 library(e1071)#支持向量机多元回归分析
 x<-read.table("C:\\Users/jacky/Desktop/000016.txt",header=T)
 x[,1]<-1:3013

#建立模型
 m <- svm(x[1:3010,5]~ .,x[1:3010,-5], cost = 1000, gamma = 0.0001)
#预测
 p<-predict(m,x[2500:3013,-5])
#取实际值
 r<-x[2500:3013,5]
#计算相对误差
 s<-0
 for(i in 1:95)
 {
 if(abs(p[i]-r[i])<0.15)
 s<-s+1
 }
 s
[1] 95
#输出结果s为95，说明所有的预测结果与实际值的误差都在0.15之内，
取0.15计算相对误差，用mean算得实际值的均值为11.9，所以相对误差为1.26%

#计算趋势预测准确率
 aa<-0
 bb<-0
 for(i in 1:94)
 {
 aa[i]<-r[i+1]-r[i]
 bb[i]<-p[i+1]-p[i]
 }
 ss<-0
 for(j in 1:94)
 {
 if(aa[j]*bb[j]>=0)
 {
 ss<-ss+1
 }
 }
 ss
[1] 93
#ss为93，所以趋势准确率为98.1%